Here is the entire output if it helps

```
[vscode@09359921b773 caf]$ launchpad /tf/launchpads/launchpad_opensource_light apply -var 'location=australiaeast'
else -var
else location=australiaeast
Launchpad management tool started with:
  tf_action   is : 'apply'
  tf_command  is : '-var location=australiaeast'
  landingzone is : '/tf/launchpads/launchpad_opensource_light'
  workspace   is : 'level0'

Checking existing Azure session
Deploying from the launchpad
Connecting to the launchpad
 - logged in objectId: bf6605bf-cbfd-4e20-8d70-ef2310af2736
Deploying '/tf/launchpads/launchpad_opensource_light'

Getting launchpad coordinates:
 - storage_account_name: sttfstate1ekkjm0fw12axf5
 - resource_group: bfad-level0-terraform-state-
 - keyvault_name: bfaddv6br2bufdtvnvp4xzu1
(SecretNotFound) Secret not found: launchpad-blob-container
 - container: 
(SecretNotFound) Secret not found: launchpad-blob-name
 - tfstate file: 

Identity of the pilot in charge of delivering the landingzone
(SecretNotFound) Secret not found: launchpad-name
 - Name: 
(SecretNotFound) Secret not found: launchpad-tenant-id
 - tenant id: 
(SecretNotFound) Secret not found: launchpad-subscription-id
 - subscription id: 
(SecretNotFound) Secret not found: launchpad-application-id
 - client id: 
(SecretNotFound) Secret not found: launchpad-service-principal-client-id
 - rover client id: 
(SecretNotFound) Secret not found: launchpad-service-principal-client-secret
(SecretNotFound) Secret not found: launchpad-prefix

Upgrading modules...
Downloading aztfmod/caf-naming/azurerm 0.1.5 for caf_name_rg...
- caf_name_rg in /home/vscode/.terraform.cache/modules/caf_name_rg/aztfmod-terraform-azurerm-caf-naming-3e7ccc0
Downloading aztfmod/caf-naming/azurerm 0.1.5 for caf_name_stg...
- caf_name_stg in /home/vscode/.terraform.cache/modules/caf_name_stg/aztfmod-terraform-azurerm-caf-naming-3e7ccc0
Downloading aztfmod/caf-diagnostics-logging/azurerm 1.0.0 for diagnostics...
- diagnostics in /home/vscode/.terraform.cache/modules/diagnostics/aztfmod-terraform-azurerm-caf-diagnostics-logging-3e5f516
Downloading aztfmod/caf-naming/azurerm 0.1.5 for diagnostics.caf_name_evh...
- diagnostics.caf_name_evh in /home/vscode/.terraform.cache/modules/diagnostics.caf_name_evh/aztfmod-terraform-azurerm-caf-naming-3e7ccc0
Downloading aztfmod/caf-naming/azurerm 0.1.5 for diagnostics.caf_name_st...
- diagnostics.caf_name_st in /home/vscode/.terraform.cache/modules/diagnostics.caf_name_st/aztfmod-terraform-azurerm-caf-naming-3e7ccc0
Downloading aztfmod/caf-log-analytics/azurerm 1.0.0 for log_analytics...
- log_analytics in /home/vscode/.terraform.cache/modules/log_analytics/aztfmod-terraform-azurerm-caf-log-analytics-7f2fdd7
Downloading aztfmod/caf-naming/azurerm 0.1.5 for log_analytics.caf_name_la...
- log_analytics.caf_name_la in /home/vscode/.terraform.cache/modules/log_analytics.caf_name_la/aztfmod-terraform-azurerm-caf-naming-3e7ccc0

Initializing the backend...

Successfully configured the backend "azurerm"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Checking for available provider plugins...
- Downloading plugin for provider "random" (hashicorp/random) 2.2.1...
- Downloading plugin for provider "null" (hashicorp/null) 2.1.2...
- Downloading plugin for provider "tls" (hashicorp/tls) 2.1.1...
- Downloading plugin for provider "azurerm" (hashicorp/azurerm) 1.42.0...
- Downloading plugin for provider "azuread" (hashicorp/azuread) 0.7.0...

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
calling plan and apply
running terraform plan with -var location=australiaeast
/tf/launchpads/launchpad_opensource_light
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.caf_name_rg.random_string.singlealphanum: Refreshing state... [id=5]
module.diagnostics.module.caf_name_evh.random_string.singlechar: Refreshing state... [id=t]
module.caf_name_rg.random_string.fullrandom: Refreshing state... [id=gzestmi1s46fxtu7qcwz9rjo8y1dr3jg3i3uxpjxpyvax4lfbig75h6jdk6ka69tgg7pvlmuaabbtt25]
module.caf_name_rg.random_string.singlechar: Refreshing state... [id=q]
module.caf_name_stg.random_string.fullrandom: Refreshing state... [id=1ekkjm0fw12axf5caeluto0k]
module.diagnostics.module.caf_name_evh.random_string.singlealphanum: Refreshing state... [id=s]
module.diagnostics.module.caf_name_st.random_string.fullrandom: Refreshing state... [id=nwzmq1h5j17sw2kpzwlhjiq1]
random_string.launchpad_password: Refreshing state... [id=fCbyHQQtiEILYpMU6skFexXpz9r4jmrMP56WKPmPdYGf2kxXaSkU33EpJjpjH4DcEcwdaa4DbEpBfBDcWdCUR9lsUFPzEXmNGP7I3p70oFX15eEkCmNnlqs8lg9B74wsgoahiBil2peo3nOtH9AJk1N0yKcIjPj7PtlVA8BQz99RAKjy2PksiAbBQKnL8zW7f7z0aqrJV4mxcBq0439OU5Mxrg4v7bbMPN5RGbPxV3nVAgIdrAqbDcKlkm]
module.diagnostics.module.caf_name_evh.random_string.fullrandom: Refreshing state... [id=p303dl0ypd53q41x2ml21v1d26xg9nztm5ij3hiint4nfmcq3r]
module.log_analytics.module.caf_name_la.random_string.singlechar: Refreshing state... [id=b]
module.caf_name_stg.random_string.singlealphanum: Refreshing state... [id=e]
module.caf_name_stg.random_string.singlechar: Refreshing state... [id=t]
random_string.prefix: Refreshing state... [id=bfad]
module.diagnostics.module.caf_name_st.random_string.singlechar: Refreshing state... [id=w]
module.log_analytics.module.caf_name_la.random_string.fullrandom: Refreshing state... [id=v5q9ehsvpypftrgsdo9q4b8emdquccy8x1n64msnk9lsh98ysw83gmwlk56jkww]
module.log_analytics.module.caf_name_la.random_string.singlealphanum: Refreshing state... [id=u]
random_string.kv_middle: Refreshing state... [id=d]
module.diagnostics.module.caf_name_st.random_string.singlealphanum: Refreshing state... [id=w]
random_string.kv_name: Refreshing state... [id=v6br2bufdtvnvp4xzu1]
data.azurerm_client_config.current: Refreshing state...
data.azurerm_subscription.primary: Refreshing state...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/146961a9-a978-4bac-bb46-4702f73deb66/resourceGroups/bfad-level0-terraform-state-]
module.log_analytics.azurerm_log_analytics_workspace.log_analytics: Refreshing state... [id=/subscriptions/146961a9-a978-4bac-bb46-4702f73deb66/resourcegroups/bfad-level0-terraform-state-/providers/microsoft.operationalinsights/workspaces/la-level0-v5q9ehsvpypftrgsdo9q4b8emdquccy8x1n64msnk9lsh98ysw83g]
azurerm_key_vault.launchpad: Refreshing state... [id=/subscriptions/146961a9-a978-4bac-bb46-4702f73deb66/resourceGroups/bfad-level0-terraform-state-/providers/Microsoft.KeyVault/vaults/bfaddv6br2bufdtvnvp4xzu1]
azurerm_storage_account.stg: Refreshing state... [id=/subscriptions/146961a9-a978-4bac-bb46-4702f73deb66/resourceGroups/bfad-level0-terraform-state-/providers/Microsoft.Storage/storageAccounts/sttfstate1ekkjm0fw12axf5]
module.diagnostics.azurerm_storage_account.log: Refreshing state... [id=/subscriptions/146961a9-a978-4bac-bb46-4702f73deb66/resourceGroups/bfad-level0-terraform-state-/providers/Microsoft.Storage/storageAccounts/stdiagnwzmq1h5j17sw2kpzw]
azurerm_key_vault_access_policy.developer: Refreshing state... [id=/subscriptions/146961a9-a978-4bac-bb46-4702f73deb66/resourceGroups/bfad-level0-terraform-state-/providers/Microsoft.KeyVault/vaults/bfaddv6br2bufdtvnvp4xzu1/objectId/bf6605bf-cbfd-4e20-8d70-ef2310af2736]
module.log_analytics.azurerm_log_analytics_solution.la_solution[0]: Refreshing state... [id=/subscriptions/146961a9-a978-4bac-bb46-4702f73deb66/resourcegroups/bfad-level0-terraform-state-/providers/Microsoft.OperationsManagement/solutions/KeyVaultAnalytics(la-level0-v5q9ehsvpypftrgsdo9q4b8emdquccy8x1n64msnk9lsh98ysw83g)]
azurerm_storage_container.launchpad: Refreshing state... [id=https://sttfstate1ekkjm0fw12axf5.blob.core.windows.net/level0]
azurerm_role_assignment.storage_blob_contributor: Refreshing state... [id=/subscriptions/146961a9-a978-4bac-bb46-4702f73deb66/resourceGroups/bfad-level0-terraform-state-/providers/Microsoft.Storage/storageAccounts/sttfstate1ekkjm0fw12axf5/providers/Microsoft.Authorization/roleAssignments/55305891-90ea-86ff-9d22-9c67185fee99]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azuread_application.launchpad will be created
  + resource "azuread_application" "launchpad" {
      + application_id  = (known after apply)
      + homepage        = (known after apply)
      + id              = (known after apply)
      + identifier_uris = (known after apply)
      + name            = "bfadlaunchpad"
      + object_id       = (known after apply)
      + owners          = (known after apply)
      + public_client   = (known after apply)
      + reply_urls      = (known after apply)
      + type            = "webapp/api"

      + oauth2_permissions {
          + admin_consent_description  = (known after apply)
          + admin_consent_display_name = (known after apply)
          + id                         = (known after apply)
          + is_enabled                 = (known after apply)
          + type                       = (known after apply)
          + user_consent_description   = (known after apply)
          + user_consent_display_name  = (known after apply)
          + value                      = (known after apply)
        }
    }

  # azuread_service_principal.launchpad will be created
  + resource "azuread_service_principal" "launchpad" {
      + application_id = (known after apply)
      + display_name   = (known after apply)
      + id             = (known after apply)
      + object_id      = (known after apply)

      + oauth2_permissions {
          + admin_consent_description  = (known after apply)
          + admin_consent_display_name = (known after apply)
          + id                         = (known after apply)
          + is_enabled                 = (known after apply)
          + type                       = (known after apply)
          + user_consent_description   = (known after apply)
          + user_consent_display_name  = (known after apply)
          + value                      = (known after apply)
        }
    }

  # azuread_service_principal_password.launchpad will be created
  + resource "azuread_service_principal_password" "launchpad" {
      + end_date             = (known after apply)
      + end_date_relative    = "43200m"
      + id                   = (known after apply)
      + key_id               = (known after apply)
      + service_principal_id = (known after apply)
      + start_date           = (known after apply)
      + value                = (sensitive value)
    }

  # azurerm_key_vault_access_policy.launchpad will be created
  + resource "azurerm_key_vault_access_policy" "launchpad" {
      + id                  = (known after apply)
      + key_permissions     = []
      + key_vault_id        = "/subscriptions/146961a9-a978-4bac-bb46-4702f73deb66/resourceGroups/bfad-level0-terraform-state-/providers/Microsoft.KeyVault/vaults/bfaddv6br2bufdtvnvp4xzu1"
      + object_id           = (known after apply)
      + resource_group_name = (known after apply)
      + secret_permissions  = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
        ]
      + tenant_id           = "8d73b928-6d5e-4c72-8533-a45ec5d6cc2b"
      + vault_name          = (known after apply)
    }

  # azurerm_key_vault_secret.launchpad_application_id will be created
  + resource "azurerm_key_vault_secret" "launchpad_application_id" {
      + id           = (known after apply)
      + key_vault_id = "/subscriptions/146961a9-a978-4bac-bb46-4702f73deb66/resourceGroups/bfad-level0-terraform-state-/providers/Microsoft.KeyVault/vaults/bfaddv6br2bufdtvnvp4xzu1"
      + name         = "launchpad-application-id"
      + tags         = (known after apply)
      + value        = (sensitive value)
      + vault_uri    = (known after apply)
      + version      = (known after apply)
    }

  # azurerm_key_vault_secret.launchpad_blob_container will be created
  + resource "azurerm_key_vault_secret" "launchpad_blob_container" {
      + id           = (known after apply)
      + key_vault_id = "/subscriptions/146961a9-a978-4bac-bb46-4702f73deb66/resourceGroups/bfad-level0-terraform-state-/providers/Microsoft.KeyVault/vaults/bfaddv6br2bufdtvnvp4xzu1"
      + name         = "launchpad-blob-container"
      + tags         = (known after apply)
      + value        = (sensitive value)
      + vault_uri    = (known after apply)
      + version      = (known after apply)
    }

  # azurerm_key_vault_secret.launchpad_blob_name will be created
  + resource "azurerm_key_vault_secret" "launchpad_blob_name" {
      + id           = (known after apply)
      + key_vault_id = "/subscriptions/146961a9-a978-4bac-bb46-4702f73deb66/resourceGroups/bfad-level0-terraform-state-/providers/Microsoft.KeyVault/vaults/bfaddv6br2bufdtvnvp4xzu1"
      + name         = "launchpad-blob-name"
      + tags         = (known after apply)
      + value        = (sensitive value)
      + vault_uri    = (known after apply)
      + version      = (known after apply)
    }

  # azurerm_key_vault_secret.launchpad_client_id will be created
  + resource "azurerm_key_vault_secret" "launchpad_client_id" {
      + id           = (known after apply)
      + key_vault_id = "/subscriptions/146961a9-a978-4bac-bb46-4702f73deb66/resourceGroups/bfad-level0-terraform-state-/providers/Microsoft.KeyVault/vaults/bfaddv6br2bufdtvnvp4xzu1"
      + name         = "launchpad-service-principal-client-id"
      + tags         = (known after apply)
      + value        = (sensitive value)
      + vault_uri    = (known after apply)
      + version      = (known after apply)
    }

  # azurerm_key_vault_secret.launchpad_client_secret will be created
  + resource "azurerm_key_vault_secret" "launchpad_client_secret" {
      + id           = (known after apply)
      + key_vault_id = "/subscriptions/146961a9-a978-4bac-bb46-4702f73deb66/resourceGroups/bfad-level0-terraform-state-/providers/Microsoft.KeyVault/vaults/bfaddv6br2bufdtvnvp4xzu1"
      + name         = "launchpad-service-principal-client-secret"
      + tags         = (known after apply)
      + value        = (sensitive value)
      + vault_uri    = (known after apply)
      + version      = (known after apply)
    }

  # azurerm_key_vault_secret.launchpad_name will be created
  + resource "azurerm_key_vault_secret" "launchpad_name" {
      + id           = (known after apply)
      + key_vault_id = "/subscriptions/146961a9-a978-4bac-bb46-4702f73deb66/resourceGroups/bfad-level0-terraform-state-/providers/Microsoft.KeyVault/vaults/bfaddv6br2bufdtvnvp4xzu1"
      + name         = "launchpad-name"
      + tags         = (known after apply)
      + value        = (sensitive value)
      + vault_uri    = (known after apply)
      + version      = (known after apply)
    }

  # azurerm_key_vault_secret.launchpad_prefix will be created
  + resource "azurerm_key_vault_secret" "launchpad_prefix" {
      + id           = (known after apply)
      + key_vault_id = "/subscriptions/146961a9-a978-4bac-bb46-4702f73deb66/resourceGroups/bfad-level0-terraform-state-/providers/Microsoft.KeyVault/vaults/bfaddv6br2bufdtvnvp4xzu1"
      + name         = "launchpad-prefix"
      + tags         = (known after apply)
      + value        = (sensitive value)
      + vault_uri    = (known after apply)
      + version      = (known after apply)
    }

  # azurerm_key_vault_secret.launchpad_resource_group will be created
  + resource "azurerm_key_vault_secret" "launchpad_resource_group" {
      + id           = (known after apply)
      + key_vault_id = "/subscriptions/146961a9-a978-4bac-bb46-4702f73deb66/resourceGroups/bfad-level0-terraform-state-/providers/Microsoft.KeyVault/vaults/bfaddv6br2bufdtvnvp4xzu1"
      + name         = "launchpad-resource-group"
      + tags         = (known after apply)
      + value        = (sensitive value)
      + vault_uri    = (known after apply)
      + version      = (known after apply)
    }

  # azurerm_key_vault_secret.launchpad_storage_account_name will be created
  + resource "azurerm_key_vault_secret" "launchpad_storage_account_name" {
      + id           = (known after apply)
      + key_vault_id = "/subscriptions/146961a9-a978-4bac-bb46-4702f73deb66/resourceGroups/bfad-level0-terraform-state-/providers/Microsoft.KeyVault/vaults/bfaddv6br2bufdtvnvp4xzu1"
      + name         = "launchpad-storage-account-name"
      + tags         = (known after apply)
      + value        = (sensitive value)
      + vault_uri    = (known after apply)
      + version      = (known after apply)
    }

  # azurerm_key_vault_secret.launchpad_subscription_id will be created
  + resource "azurerm_key_vault_secret" "launchpad_subscription_id" {
      + id           = (known after apply)
      + key_vault_id = "/subscriptions/146961a9-a978-4bac-bb46-4702f73deb66/resourceGroups/bfad-level0-terraform-state-/providers/Microsoft.KeyVault/vaults/bfaddv6br2bufdtvnvp4xzu1"
      + name         = "launchpad-subscription-id"
      + tags         = (known after apply)
      + value        = (sensitive value)
      + vault_uri    = (known after apply)
      + version      = (known after apply)
    }

  # azurerm_key_vault_secret.launchpad_tenant_id will be created
  + resource "azurerm_key_vault_secret" "launchpad_tenant_id" {
      + id           = (known after apply)
      + key_vault_id = "/subscriptions/146961a9-a978-4bac-bb46-4702f73deb66/resourceGroups/bfad-level0-terraform-state-/providers/Microsoft.KeyVault/vaults/bfaddv6br2bufdtvnvp4xzu1"
      + name         = "launchpad-tenant-id"
      + tags         = (known after apply)
      + value        = (sensitive value)
      + vault_uri    = (known after apply)
      + version      = (known after apply)
    }

  # azurerm_role_assignment.launchpad_role1 will be created
  + resource "azurerm_role_assignment" "launchpad_role1" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Owner"
      + scope                            = "/subscriptions/146961a9-a978-4bac-bb46-4702f73deb66"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 16 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: /home/vscode/.terraform.cache/tfstates/level0/launchpad_opensource_light.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/vscode/.terraform.cache/tfstates/level0/launchpad_opensource_light.tfplan"

running terraform apply
azuread_application.launchpad: Creating...

Error: graphrbac.ApplicationsClient#Create: Failure responding to request: StatusCode=403 -- Original Error: autorest/azure: Service returned an error. Status=403 Code="Unknown" Message="Unknown service error" Details=[{"odata.error":{"code":"Authorization_RequestDenied","date":"2020-02-20T22:35:48","message":{"lang":"en","value":"Insufficient privileges to complete the operation."},"requestId":"972d398a-c415-4069-b680-62efba4f7c74"}}]

  on identity.tf line 4, in resource "azuread_application" "launchpad":
   4: resource "azuread_application" "launchpad" {


cleanup variables
[vscode@09359921b773 caf]$ launchpad /tf/launchpads/launchpad_opensource_light apply -var 'location=australiaeast'
```